[
    {
        "date": "LAS VEGAS, USA | JANUARY 5, 2016",
        "title": "Gogoro brings Smartscooter™ EVs to new markets, beyond megacities, with introduction of the Gogoro OPEN Initiative",
        "description": "Gogoro, a technology company transforming how energy is distributed and managed in cities, today announced the introduction of the Gogoro GoChargerTM and Gogoro OPEN Initiative, creating a more scalable and readily available solution for customers outside of Gogoro’s planned megacity rollout.",
        "url": "/tw/en/press/releases/2016-01-05-gogoro-ces-gocharger-open"
    },
    {
        "date": "PARIS, FRANCE | DECEMBER 3, 2015",
        "title": "Gogoro CEO Horace Luke To Speak At The Sustainable Innovation Forum At COP21 In Paris",
        "description": "Gogoro, a technology company transforming how energy is distributed and managed in megacities, today announced co-founder and CEO Horace Luke would be speaking at the Sustainable Innovation Forum at COP21 in Paris on Tuesday, December 8th. Luke will be highlighting Gogoro’s successful deployment in Greater Taipei this year and how the collaboration between the public and private sector were key in making it a reality. Gogoro will also be exhibiting its battery-swapping stations and the Gogoro Smartscooter at the Sustainable Innovation Forum and Solutions COP21 exhibition.",
        "url": "/tw/en/press/releases/2015-12-04-gogoro-COP21"
    },
    {
        "date": "MILAN, ITALY | NOVEMBER 17, 2015",
        "title": "Gogoro to Launch Smartscooter™ and Gogoro® Energy Network in Europe in 2016",
        "description": "Gogoro, a technology company transforming how energy is distributed and managed in megacities, today announced it would launch its Gogoro® Smartscooter™ EV and Gogoro Energy Network in Europe in 2016.  The European rollout follows Gogoro’s successful commercial rollout in Taipei this past summer. The announcement was made at the international motorcycle and scooter show in Milan Italy, Esposizione Internazionale Ciclo e Motociclo e Accessori (EICMA).",
        "url": "/tw/en/press/releases/2015-11-17-gogoro-ready-to-roll-europe"
    },
    {
        "date": "TAIPEI, TAIWAN | NOVEMBER 13, 2015",
        "title": "Gogoro Announces New Investors Including Panasonic And The National Development Fund Of Taiwan, Gogoro Has Raised More Than $180 Million In Total Capital",
        "description": "Gogoro, an innovative technology company transforming how energy is distributed and managed in megacities, today announced it had closed its Series B equity financing round with more than $130 million that was led by Ruentex Group Chairman Dr. Samuel Yin and includes new investments from Panasonic Corporation, the National Development Fund of Taiwan and others.  Panasonic, one of the leading companies in battery innovation and a supplier of Gogoro battery cells, is the first strategic investor in Gogoro. Gogoro has raised more than $180 million in total equity funding since it was founded in 2011.",
        "url": "/tw/en/press/releases/2015-11-13-gogoro-df-panasonic-funding"
    },
    {
        "date": "TAIPEI, TAIWAN | MARCH 30, 2015",
        "title": "Gogoro® Announces Taipei As Pilot Market, Smartscooter™ EV Set To Launch This Summer",
        "description": "Gogoro, an innovative technology company transforming how energy is distributed and managed in megacities, today announced Taipei City and New Taipei City Taiwan as the pilot market for the Gogoro Smartscooter™ electric vehicle and Gogoro Energy Network, set to be available this summer. Gogoro also announced the opening of the Gogoro Experience Center, a flagship store in Taipei's prime shopping district, designed to promote hands-on interaction with the Smartscooter™ EV.",
        "url": "/tw/en/press/releases/2015-03-30-gogoro-announces-taipei-as-pilot-market"
    }
]
