[
    {
        "date": "Gogoro | November 25, 2105",
        "title": "Gogoro Announced Amsterdam as First Expansion City",
        "description": "We just returned from an amazing trip to Europe where Gogoro exhibited at EICMA, the international motorcycle and scooter show in Milan Italy.  Our big news was announcing Amsterdam as our first global expansion city in 2016.",
        "url": "/blog/releases/2015-11-26-gogoro-EICMA"
    },
    {
        "date": "Gogoro | MARCH 30, 2015",
        "title": "It Starts Here: Taipei",
        "description": "We realize one company can’t accomplish this, it takes different communities, organizations and governments working together to drive innovative new thought, business models and inventions but we strongly believe this will bring dramatic social, economic and environmental improvements for generations to come.",
        "url": "/blog/releases/2015-03-30-it-starts-here-taipei"
    },
    {
        "date": "Gogoro | MARCH 12, 2015",
        "title": "SMART URBANIZATION: A NEW PERSPECTIVE ON CITY GROWTH",
        "description": "The rapid growth of megacities has introduced new challenges and opportunities – not just for municipal governments, but for each of us. The problems we face in making sure our infrastructure, resource distribution and pollution management keep pace with the needs of population growth are staggering – but so are the solutions we are creating to solve those problems.",
        "url": "/blog/releases/2015-03-12-smart-urbanization"
    },
    {
        "date": "Gogoro | JANUARY 22, 2015",
        "title": "WOW, WHAT AN AMAZING LAUNCH",
        "description": "It has been an incredible start of the year for Gogoro! We were amazed at the level of excitement we received at the Consumer Electronics Show (CES) in Las Vegas, and the continued interest we’re seeing from around the world has been overwhelming.",
        "url": "/blog/releases/2015-01-22-wow-what-an-amazing-launch"
    },
    {
        "date": "Gogoro | JANUARY 5, 2015",
        "title": "READY, SET, GO",
        "description": "This is a momentous day for all of us at Gogoro—a day we’ve been working towards since the company’s inception. For more than three years, our teams of engineers, designers, and innovators have been working tirelessly to create technology to ignite the transformation of the world's megacities into smart cities. ",
        "url": "/blog/releases/2015-01-05-ready-set-go"
    }
]
